tocache/Microchip-PIC18F4550/UPC Microcontroladores 2019-2/Semana 10/test_lcd.X/newmain2.c
//Este es un comentario
/*Este es otro comentario*/

// PIC18F4550 Configuration Bit Settings
#pragma config PLLDIV = 1       // PLL Prescaler Selection bits (No prescale (4 MHz oscillator input drives PLL directly))
#pragma config CPUDIV = OSC1_PLL2// System Clock Postscaler Selection bits ([Primary Oscillator Src: /1][96 MHz PLL Src: /2])
#pragma config FOSC = XTPLL_XT  // Oscillator Selection bits (XT oscillator, PLL enabled (XTPLL))
#pragma config PWRT = ON        // Power-up Timer Enable bit (PWRT enabled)
#pragma config BOR = OFF        // Brown-out Reset Enable bits (Brown-out Reset disabled in hardware and software)
#pragma config BORV = 3         // Brown-out Reset Voltage bits (Minimum setting 2.05V)
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)
#pragma config CCP2MX = ON      // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = OFF     // PORTB A/D Enable bit (PORTB<4:0> pins are configured as digital I/O on Reset)
#pragma config LPT1OSC = OFF    // Low-Power Timer 1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)
#pragma config LVP = OFF        // Single-Supply ICSP Enable bit (Single-Supply ICSP disabled)


#include <xc.h>
#include "LCD.h"
#define _XTAL_FREQ 48000000UL   // Frecuencia de trabajo del microcontrolador

unsigned int temporal = 0;
unsigned int temporal2 = 0;
unsigned int digmil = 0;
unsigned int digcen = 0;
unsigned int digdec = 0;
unsigned int diguni = 0;
unsigned int an0_raw = 0;

unsigned int conviertemenso(numero){
    digmil = numero / 1000;
    temporal = numero - (digmil * 1000);
    digcen = temporal / 100;
    temporal2 = temporal - (digcen * 100);
    digdec = temporal2 / 10;
    diguni = temporal2 - (digdec * 10);          
}

void main(void) {
    __delay_ms(15);
    TRISD = 0x00;
    LCD_CONFIG();
    __delay_ms(10);
    CURSOR_ONOFF(OFF);
    BORRAR_LCD();
    CURSOR_HOME();
    ESCRIBE_MENSAJE("Hola mundo",10);
    POS_CURSOR(2,0);
    ESCRIBE_MENSAJE("ADC: ",5);
    ADCON2 = 0x91;          //4TAD FOSC/64 Justificacion a la izquierda
    ADCON1 = 0x0E;          //AN0 habilitado   
    ADCON0 = 0x01;          //Encender el A/D
    
    while(1){
        ADCON0bits.GO = 1;
        while(ADCON0bits.GO);
        an0_raw = ADRESH << 8;
        an0_raw = an0_raw + ADRESL;
        conviertemenso(an0_raw);
        ENVIA_CHAR(digmil+0x30);
        ENVIA_CHAR(digcen+0x30);
        ENVIA_CHAR(digdec+0x30);
        ENVIA_CHAR(diguni+0x30);
        POS_CURSOR(2,5);
        //__delay_ms(50);
    }
}

